<ul>
    <li>Список товаров со всей инфой (катгория, рейтинг, количество покупок за все время, характиристики)<br>
    <small>А также контроль количества каждого конретного товара на складе (кнопкой и добавлением/убавлением)</small>
        <br>
        <small>Ну и категорию поменять можно</small>
        <br>
        <small>А, Ну и товар же создать тоже</small>
        <br>
    </li>
    <li>Полный КРУД по всем параметрам и самим товарам (акция, товары, цена, характиристики и т.д.), а для лайков
        - только стереть все, или не трогать вовсе.</li>
</ul>