<ul>
    <li>Список действующих акций</li>
    <li>КРУД по действующим акциям (возможность удалить, добавить или изменить какой-то из параметров, напирмер % или время, или товары под ней)</li>
    <li>Список товаров с этой акцией и возможность удалить акцию с данного товара</li>
    <li>*При создании новой акции товары к ней не привязываются, ПОТОМУ ЧТО Акция привязывается к Товару, при создании нового товара в секции Товаров</li>
    <li>*НО, при создании акции можно привязать ее ко всем товарам в одной из списка (всех) категорий,привязка идет только к тем товарам, которые не имеют акции</li>
</ul>