<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки содержат сообщения по умолчанию, используемые
    | классом, проверяющим значения (валидатором). Некоторые из правил имеют
    | несколько версий, например, size. Вы можете поменять их на любые
    | другие, которые лучше подходят для вашего приложения.
    |
    */
    'categories' => [
        'Household'          => 'Домохозяйство',
        'Vegetables'         => 'Овощи',
        'Fruit'              => 'Фрукты',
        'Soft_drinks'        => 'Безалкогольные Напитки',
        'Juices'             => 'Соки',
        'Energy_Drinks'      => 'Энергетические напитки',
        'Frozen_Snacks'      => 'Замороженные закуски',
        'Frozen_Vegetables'  => 'Замороженные овощи',
        'Bakery'             => 'Хлебобулочные Изделия',
        'Pet_food'           => 'Корм Для Животных',
        'Household_Cleaning' => 'Чистящие Средства',
        'Household_Utensils' => 'Посуда',


    ],


    'sections'  => [
        'About Us'                    => 'О нас',
        'Meet Our Amazing Team'       => 'Познакомьтесь с нашей замечательной командой',
        'Testimonials'                => 'Отзывы',
        'Events'                      => 'События',
        'Best Deals'                  => 'Лучшие предложения',
        'Services'                    => 'Услуги',
        'Special offers'              => 'Специальные предложения',
        'Search'                      => 'Поиск',
        'View Your Cart'              => 'Моя корзина',
        'Contact Us'                  => 'Свяжитесь с нами',
        'Login'                       => 'Войти',
        'Sign up'                     => 'Зарегистрироваться',
        'Grocery'                     => 'Продуктовый',
        'Store'                       => 'Магазин',
        'Hot Offers'                  => 'Гарячие Предложения',
        'Top Products'                => 'Лучшие Продукты',
        'Popular Brands'              => 'Популярное',
        'Home'                        => 'На главную',
        'Best Deals For New Products' => 'Лучшие Предложения Для Новых Продуктов',
        'Checkout'                    => 'Проверка',
        'Payment'                     => 'Оплата',
        'Terms of Use'                => 'Условия Эксплуатации',
        'Privacy Policy'              => 'Политика Конфиденциальности',
        'Branded Foods'               => 'Фирменные Продукты',
        'policy info'                 => 'Информация о политике',
        'information'                 => 'Информация',
        'Categories'                  => 'Категории',
        'Website'                     => 'Веб-сайт',


    ],
    'positions' => [
        'Manager'    => 'Менеджер',
        'Supervisor' => 'Руководитель',
        'customer'   => 'Покупатель',
        'Admin'      => 'Администрирование',
    ],

    'other' => [
        'sign up for our newsletter'                                                                                   => 'Подпишитесь на нашу рассылку',
        'Shop Now'                                                                                                     => 'Скупиться',
        'add to cart'                                                                                                  => 'Добавить в Корзину',
        'Followers'                                                                                                    => 'Подписчики',
        'Savings'                                                                                                      => 'Экономия',
        'Support'                                                                                                      => 'Поддержка',
        'Popularity'                                                                                                   => 'Популярность',
        'Make your food with Spicy'                                                                                    => 'Зробіть вашу їжу Пряною',
        'Discount offer'                                                                                               => 'Скидочное предложение',
        'privacy policy'                                                                                               => 'Политика Конфиденциальности',
        'secure payments'                                                                                              => 'Безопасные Платежи',
        'All rights reserved'                                                                                          => 'Все права защищены',
        'subscribe now'                                                                                                => 'Подписаться',
        'Stock'                                                                                                        => 'На складе',
        'Producer'                                                                                                     => 'Изготовитель',
        'Address'                                                                                                      => 'Адрес',
        'Produced'                                                                                                     => 'Изготовлено',
        'Expiration'                                                                                                   => 'Истечение срока годности',
        'Phone'                                                                                                        => 'Телефон',
        'Mail'                                                                                                         => 'Почта',
        'Arrival'                                                                                                      => 'Поступление',
        'Products count in your shopping cart'                                                                         => 'Количество товаров в вашей корзине',
        'Product'                                                                                                      => 'Товар',
        'Amount'                                                                                                       => 'Количество',
        'Name'                                                                                                         => 'Наименование',
        'Price'                                                                                                        => 'Стоимость',
        'Remove'                                                                                                       => 'Удалить',
        'Continue to basket'                                                                                           => 'В Корзине',
        'Total Service Charges'                                                                                        => 'Общая стоимость услуг',
        'Total'                                                                                                        => 'Всего',
        'Add a new Details'                                                                                            => 'Детали',
        'Full name'                                                                                                    => 'Полное Имя',
        'Mobile number'                                                                                                => 'Номер телефона',
        'Locality'                                                                                                     => 'Населенный пункт',
        'Address type'                                                                                                 => 'Тип расположения',
        'Office'                                                                                                       => 'Офис',
        'Home'                                                                                                         => 'Дом',
        'Commercial'                                                                                                   => 'Коммерческое здание',
        'Delivery to this Address'                                                                                     => 'Доставка по этому адресу',
        'Make a Payment'                                                                                               => 'Произвести Оплату',
        'Admin'                                                                                                        => 'Администратор',
        'call to us'                                                                                                   => 'Позвоните нам',
        'Subject'                                                                                                      => 'Тема',
        'Message'                                                                                                      => 'Сообщение',
        'Submit'                                                                                                       => 'Отправить',
        'Clear'                                                                                                        => 'Очистить',
        'Cash on delivery'                                                                                             => 'Оплата при доставке',
        'Credit'                                                                                                       => 'Кредит',
        'Account'                                                                                                      => 'Аккаунт',
        'We also accept Credit/Debit card on delivery. Please Check with the agent.'                                   => 'Мы также принимаем кредитную / дебетовую карту при доставке. Пожалуйста, уточните у агента.',
        'Name on Card'                                                                                                 => 'Имя на Карте',
        'John Smith'                                                                                                   => 'Джон Смитт',
        'Card Number'                                                                                                  => 'Номер карты',
        'Expiration Date'                                                                                              => 'Срок годности',
        'MM / YY'                                                                                                      => 'ММ / ГГ',
        'Pick from Popular Banks'                                                                                      => 'Выберите из популярных банков',
        'Bank'                                                                                                         => 'Банк',
        'Or PICK OTHER BANK'                                                                                           => 'Или выберите другой банк',
        'Other Banks'                                                                                                  => 'Другие Банки',
        'Important: You will be redirected to PayPal\'s website to securely complete your payment.'                    => 'Важно: вы будете перенаправлены на веб-сайт PayPal для надежного завершения платежа',
        'Card Holder Name'                                                                                             => 'Имя владельца карты',
        'Valid Thru'                                                                                                   => 'Годен До',
        'Add to My Cards'                                                                                              => 'Добавить в мои карты',
        'Proceed Payment'                                                                                              => 'Выполнить оплату',
        'Hi'                                                                                                           => 'Здравствуйте!',
        'Thank you for creating an account with us. Don\'t forget to complete your registration!'                      => 'Спасибо, что создали учетную запись у нас. Не забудьте завершить регистрацию!',
        'Please click on the link below or copy it into the address bar of your browser to confirm your email address' => 'Нажмите на ссылку ниже или скопируйте ее в адресную строку своего браузера, чтобы подтвердить свой адрес электронной почты',
        'Confirm my email address'                                                                                     => 'Подтвердить мой адрес электронной почты',
        'Your Cart'                                                                                                    => 'Корзина',
        'Empty'                                                                                                        => 'Пусто',
        'Close'                                                                                                        => 'Закрыть',
        'Language'                                                                                                     => 'Язык',
        'No products available'                                                                                        => 'Нет доступных товаров',
        'Add to card'                                                                                                  => 'Положить в корзину',
        'Product successfully added to your cart'                                                                      => 'Товар успешно добавлен в корзину!',
        'Available'                                                                                                    => 'Доступно',
        'Sale'                                                                                                         => 'Знижка',
        'Categorie'                                                                                                    => 'Категория',
        'Rating'                                                                                                       => 'Рейтинг',
        'Show products'                                                                                                => 'Показать товары',
        'Valid from'                                                                                                   => 'Действует с',
        'Lasts until'                                                                                                  => 'Завершается',
        'Summary Price'                                                                                                => 'Итоговая цена',
        'In the cart'                                                                                                  => 'В корзине',
        'units'                                                                                                        => 'единиц',
        'Error'                                                                                                        => 'Упс! Что-то пошло не так!',
        'Exit'                                                                                                         => 'Выход',
        'Welcome'                                                                                                      => 'Добро пожаловать',
        'Online'                                                                                                       => 'Онлайн',
        'Offline'                                                                                                      => 'Оффлайн',
    ],

    'goods'  => [

    ],
    'weight' => [
        'kg' => 'кг',//кило
        'l'  => 'л',//литр
        'th' => 'шт',//штука
        ''   => ''
    ],

    'time' => [
        'July' => 'Июль',
    ],

    'admin-categies' => [
        'Main'           => 'Главная',
        'News'           => 'Новости',
        'Users'          => 'Пользователи',
        'Goods'          => 'Товары',
        'Sales'          => 'Акции',
        'Categories'     => 'Категории',
        'Configurations' => 'Настройки',
        'Statistics'     => 'Статистика',
    ],
    /*______________________________________*/

    'accepted'             => 'Вы должны принять :attribute.',
    'active_url'           => 'Поле :attribute содержит недействительный URL.',
    'after'                => 'В поле :attribute должна быть дата после :date.',
    'after_or_equal'       => 'В поле :attribute должна быть дата после или равняться :date.',
    'alpha'                => 'Поле :attribute может содержать только буквы.',
    'alpha_dash'           => 'Поле :attribute может содержать только буквы, цифры и дефис.',
    'alpha_num'            => 'Поле :attribute может содержать только буквы и цифры.',
    'array'                => 'Поле :attribute должно быть массивом.',
    'before'               => 'В поле :attribute должна быть дата до :date.',
    'before_or_equal'      => 'В поле :attribute должна быть дата до или равняться :date.',
    'between'              => [
        'numeric' => 'Поле :attribute должно быть между :min и :max.',
        'file'    => 'Размер файла в поле :attribute должен быть между :min и :max Килобайт(а).',
        'string'  => 'Количество символов в поле :attribute должно быть между :min и :max.',
        'array'   => 'Количество элементов в поле :attribute должно быть между :min и :max.',
    ],
    'boolean'              => 'Поле :attribute должно иметь значение логического типа.',
    // калька 'истина' или 'ложь' звучала бы слишком неестественно
    'confirmed'            => 'Поле :attribute не совпадает с подтверждением.',
    'date'                 => 'Поле :attribute не является датой.',
    'date_format'          => 'Поле :attribute не соответствует формату :format.',
    'different'            => 'Поля :attribute и :other должны различаться.',
    'digits'               => 'Длина цифрового поля :attribute должна быть :digits.',
    'digits_between'       => 'Длина цифрового поля :attribute должна быть между :min и :max.',
    'dimensions'           => 'Поле :attribute имеет недопустимые размеры изображения.',
    'distinct'             => 'Поле :attribute содержит повторяющееся значение.',
    'email'                => 'Поле :attribute должно быть действительным электронным адресом.',
    'file'                 => 'Поле :attribute должно быть файлом.',
    'filled'               => 'Поле :attribute обязательно для заполнения.',
    'exists'               => 'Выбранное значение для :attribute некорректно.',
    'image'                => 'Поле :attribute должно быть изображением.',
    'in'                   => 'Выбранное значение для :attribute ошибочно.',
    'in_array'             => 'Поле :attribute не существует в :other.',
    'integer'              => 'Поле :attribute должно быть целым числом.',
    'ip'                   => 'Поле :attribute должно быть действительным IP-адресом.',
    'ipv4'                 => 'Поле :attribute должно быть действительным IPv4-адресом.',
    'ipv6'                 => 'Поле :attribute должно быть действительным IPv6-адресом.',
    'json'                 => 'Поле :attribute должно быть JSON строкой.',
    'max'                  => [
        'numeric' => 'Поле :attribute не может быть более :max.',
        'file'    => 'Размер файла в поле :attribute не может быть более :max Килобайт(а).',
        'string'  => 'Количество символов в поле :attribute не может превышать :max.',
        'array'   => 'Количество элементов в поле :attribute не может превышать :max.',
    ],
    'mimes'                => 'Поле :attribute должно быть файлом одного из следующих типов: :values.',
    'mimetypes'            => 'Поле :attribute должно быть файлом одного из следующих типов: :values.',
    'min'                  => [
        'numeric' => 'Поле :attribute должно быть не менее :min.',
        'file'    => 'Размер файла в поле :attribute должен быть не менее :min Килобайт(а).',
        'string'  => 'Количество символов в поле :attribute должно быть не менее :min.',
        'array'   => 'Количество элементов в поле :attribute должно быть не менее :min.',
    ],
    'not_in'               => 'Выбранное значение для :attribute ошибочно.',
    'numeric'              => 'Поле :attribute должно быть числом.',
    'present'              => 'Поле :attribute должно присутствовать.',
    'regex'                => 'Поле :attribute имеет ошибочный формат.',
    'required'             => 'Поле :attribute обязательно для заполнения.',
    'required_if'          => 'Поле :attribute обязательно для заполнения, когда :other равно :value.',
    'required_unless'      => 'Поле :attribute обязательно для заполнения, когда :other не равно :values.',
    'required_with'        => 'Поле :attribute обязательно для заполнения, когда :values указано.',
    'required_with_all'    => 'Поле :attribute обязательно для заполнения, когда :values указано.',
    'required_without'     => 'Поле :attribute обязательно для заполнения, когда :values не указано.',
    'required_without_all' => 'Поле :attribute обязательно для заполнения, когда ни одно из :values не указано.',
    'same'                 => 'Значение :attribute должно совпадать с :other.',
    'size'                 => [
        'numeric' => 'Поле :attribute должно быть равным :size.',
        'file'    => 'Размер файла в поле :attribute должен быть равен :size Килобайт(а).',
        'string'  => 'Количество символов в поле :attribute должно быть равным :size.',
        'array'   => 'Количество элементов в поле :attribute должно быть равным :size.',
    ],
    'string'               => 'Поле :attribute должно быть строкой.',
    'timezone'             => 'Поле :attribute должно быть действительным часовым поясом.',
    'unique'               => 'Такое значение поля :attribute уже существует.',
    'uploaded'             => 'Загрузка поля :attribute не удалась.',
    'url'                  => 'Поле :attribute имеет ошибочный формат.',
    'branch_access_not'    => 'У Вас нет прав',
    'invalid_branch_type'  => 'Неправильный тип ветки',

    /*
    |--------------------------------------------------------------------------
    | Собственные языковые ресурсы для проверки значений
    |--------------------------------------------------------------------------
    |
    | Здесь Вы можете указать собственные сообщения для атрибутов.
    | Это позволяет легко указать свое сообщение для заданного правила атрибута.
    |
    | http://laravel.com/docs/validation#custom-error-messages
    | Пример использования
    |
    |   'custom' => [
    |       'email' => [
    |           'required' => 'Нам необходимо знать Ваш электронный адрес!',
    |       ],
    |   ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Собственные названия атрибутов
    |--------------------------------------------------------------------------
    |
    | Последующие строки используются для подмены программных имен элементов
    | пользовательского интерфейса на удобочитаемые. Например, вместо имени
    | поля "email" в сообщениях будет выводиться "электронный адрес".
    |
    | Пример использования
    |
    |   'attributes' => [
    |       'email' => 'электронный адрес',
    |   ],
    |
    */

    'attributes' => [
    ],
];